

-- =============================================================================
-- todo 2.1 用户变动统计
-- =============================================================================
/*
    统计周期	指标	说明
    最近1日	流失用户数	之前活跃过的用户，最近一段时间未活跃，就称为流失用户。
                        此处要求统计7日前（只包含7日前当天）活跃，但最近7日未活跃的用户总数。
                        todo last_login_date = date_sub('2024-03-24', 7)

    最近1日	回流用户数	之前的活跃用户，一段时间未活跃（流失），今日又活跃了，就称为回流用户。
                        此处要求统计回流用户总数。
                        todo last_login_date = '2024-03-24'
                             AND
                             yesterday_last_login_date < date_sub('2024-03-23', 7)

    `dt`               STRING COMMENT '统计日期',
    `user_churn_count` BIGINT COMMENT '流失用户数',
    `user_back_count`  BIGINT COMMENT '回流用户数'
*/




-- =============================================================================
-- todo 2.2 用户留存率
-- =============================================================================
/*
新增留存率具体是指留存用户数与新增用户数的比值，
    例如2020-06-14新增100个用户，1日之后（2020-06-15）这100人中有80个人活跃了，
        那2020-06-14的1日留存数则为80，2020-06-14的1日留存率则为80%。

新增留存分析：每天新增用户中，有多少用户继续活跃。
			新增用户数  2024-04-02	2024-04-03	2024-04-04	2024-04-05	2024-04-06	2024-04-07	2024-04-08
2024-04-01	  100	   1日$30#30%	2日$20#20%  3日$15#15%	4日$10#10%	5日$9#9%		6日$7#7%		7日$4#4%

2024-04-02	  80					1日$20#25%	2日$10#12.5% 3日$8#10%  3日$4#5%

2024-04-03	  200								1日$20#10%	 2日$10#5%
*/






-- =============================================================================
-- todo 2.3 用户新增活跃统计
-- =============================================================================
/*
    统计周期	        指标	        指标说明
    最近1、7、30日	新增用户数	略

    最近1、7、30日	活跃用户数	略
*/



-- =============================================================================
-- todo 2.4 用户行为漏斗分析
-- =============================================================================
/*
    该需求要求统计一个完整的购物流程各个阶段的人数，具体说明如下：
    统计周期	        指标	            说明
    最近1、7、30日	首页浏览人数	    略
    最近1、7、30日	商品详情页浏览人数	略
    最近1、7、30日	加购人数	        略
    最近1、7、30日	下单人数	        略
    最近1、7、30日	支付人数	        支付成功人数

    `dt`                STRING COMMENT '统计日期',
    `recent_days`       BIGINT COMMENT '最近天数,1:最近1天,7:最近7天,30:最近30天',
    `home_count`        BIGINT COMMENT '浏览首页人数',
    `good_detail_count` BIGINT COMMENT '浏览商品详情页人数',
    `cart_count`        BIGINT COMMENT '加入购物车人数',
    `order_count`       BIGINT COMMENT '下单人数',
    `payment_count`     BIGINT COMMENT '支付人数'
*/



-- =============================================================================
-- todo 2.5 最近7日内连续3日下单用户数
-- =============================================================================
/*
    `dt`                            STRING COMMENT '统计日期',
    `recent_days`                   BIGINT COMMENT '最近天数,7:最近7天',
    `order_continuously_user_count` BIGINT COMMENT '连续3日下单用户数
*/



